In [3]:
#Q1
import numpy as np
arr = np.array(range(1, 19)).reshape(6,3)
arr
# arr1=np.array(6,3)
# print("arr1:{}".format(arr1))

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12],
       [13, 14, 15],
       [16, 17, 18]])

In [4]:
import pandas as pd
#df=pd.read_csv()
#df=pd.read_excel()
df=pd.read_excel(r"D:\Workshop\Datascience\Breast-Cancer-Detection-using-Machine-Learning-master\Week 1 Dataset.xlsx")
print(df)
#Q2
df1=df.rename(columns={"State":"State_name","Name":"UserName","Income per month":"Income/month","Age":"Age in years","Sex":"sex","Number of siblings":"Siblings"})
df1
print(df1)

  Name  Income per month          State  Age Sex  Number of siblings
0    A                50     Tamil Nadu   23   M                   0
1    B                34      Karnataka   37   F                   3
2    C                54     Tamil Nadu   35   F                   1
3    D                24  Uttar Pradesh   26   F                   4
4    E                19          Bihar   59   M                   5
5    F                21          Bihar   48   M                   6
6    G                40          Delhi   30   F                   2
7    H                20  Uttar Pradesh   72   M                  10
8    I                30      Telangana   22   F                   0
9    J                18    Chattisgarh   42   M                   7
  UserName  Income/month     State_name  Age in years sex  Siblings
0        A            50     Tamil Nadu            23   M         0
1        B            34      Karnataka            37   F         3
2        C            54     Tamil Nadu            35   F         1
3        D            24  Uttar Pradesh            26   F         4
4        E            19          Bihar            59   M         5
5        F            21          Bihar            48   M         6
6        G            40          Delhi            30   F         2
7        H            20  Uttar Pradesh            72   M        10
8        I            30      Telangana            22   F         0
9        J            18    Chattisgarh            42   M         7

In [5]:
#Q3
#Dropping State_name column
df1.drop('State_name', axis=1).head()
#drop() has inplace=false by-default
df1.head()
#drop() inplace=true
df1.drop('State_name',axis=1,inplace=True)
df1.head()

  UserName  Income/month  Age in years sex  Siblings
0        A            50            23   M         0
1        B            34            37   F         3
2        C            54            35   F         1
3        D            24            26   F         4
4        E            19            59   M         5

In [6]:
#Q4
df[["Sex","Number of siblings"]]

  Sex  Number of siblings
0   M                   0
1   F                   3
2   F                   1
3   F                   4
4   M                   5
5   M                   6
6   F                   2
7   M                  10
8   F                   0
9   M                   7

In [7]:
#Q5
df.iloc[2:9,0:4]

  Name  Income per month          State  Age
2    C                54     Tamil Nadu   35
3    D                24  Uttar Pradesh   26
4    E                19          Bihar   59
5    F                21          Bihar   48
6    G                40          Delhi   30
7    H                20  Uttar Pradesh   72
8    I                30      Telangana   22

In [8]:
#Q6
df["Number of siblings"].value_counts()

0     2
10    1
7     1
6     1
5     1
4     1
3     1
2     1
1     1
Name: Number of siblings, dtype: int64

In [9]:
#Q7
#Independant Variables-Name,state,Sex,Age,Number of Siblings
#Dependant Variables-Income per month

#Q8
#1.Increse in number of age will increase the number of siblings
#2.Increase in Income per month will decrese the number of siblings
#3.Increase in Age will decrease the Income per month